"""
Домашнє завдання: Основи Python

**1.** 
Створіть три змінні з правильними іменами (англійською мовою): 
одну для збереження віку, 
одну для імені студента, 
одну для позначення чи є особа студентом. 
Додайте коментарі до кожної змінної.

"""
# змінна для збереження віку студента
age = 23
# ім'я студента.
student_name = "Alex"
# чи є особа студентом?
is_student = True

"""
**2.** Рзкоментуйте та виправте помилки в наступних назвах змінних.
Поясніть у коментарях, чому початкові назви неправильні:
"""
name = "John"
# На початку змінної цифра. При створенні назви змінної, таке не може бути.
# user-age = 25. Це оператор віднімання, чи не так? Такого в змінній не має бути
user_age = 25
# $price = 100. Долар - зайвий символ перед змінною.
price = 100
# class = "Math". Змінна це зарезервована команда у Пітоні. Потрібно лиш змінити змінну на інше.
school_course = "Math"
"""
**3.** Створіть змінну з описовим ім'ям для збереження максимальної кількості студентів у групі. 
Присвойте їй значення 30.
"""
class_size = 30

"""
**4.** Створіть змінні для збереження: 
назви курсу, 
кількості годин, 
вартості курсу. 
Використайте правильне іменування змінних.
"""
course_name = "Python для початківців"
total_hrs = 60
course_pricing = 3000

"""
**5.** Розрхуйте та виведіть Затрати курсу: 
Затрати курсу  = кількість годин / вартість курсу
Використайте правильне іменування змінних.
"""
# код вводити тут
total_hrs = 60
course_pricing = 3000
expenses = total_hrs / course_pricing
print(f"Кількість наших годин: {total_hrs}")
print(f"Вартість цього курсу: {course_pricing}")      

"""
**6.** Створіть змінні з різними способами запису чисел:
- Десяткове число: 42
- Двійкове число: 101010 (в двійковій системі)
- Шістнадцяткове число: 2A (в шістнадцятковій системі)
- Восьмеричне число: 52 (в восьмеричній системі)
"""

decimal = 45
binary = 101010
octal = 52



"""
**7.** Виконайте всі арифметичні операції (+, -, *, /, //, %, **) з числами 17 та 5. 
Виведіть результати з поясненнями.
"""
one = 17
two = 5
print(f"додавання: {one + two}")
print(f"віднімання: {one - two}")
print(f"множення: {one * two}")
print(f"ділення: {one / two}")
print(f"піднесення до степеня: {one - two}")


"""
**8.** Обчисліть площу кола з радіусом 7.5. Використайте значення π = 3.14159.
"""
r = 7.5
pi = 3.14159
circle = pi * (r ** 2)

"""
**9.** Обчисліть залишок від ділення будь-якого числа на 7. 
Виведіть результат з числами 50, 33, 14.
"""
remain_50 = 50 % 7
remain_33 = 33 % 7
remain_14 = 14 % 7
print("діл 50 на 7 =:", remain_50)
print("діл 33 на 7 =:", remain_33)
print("діл 14 на 7 =:", remain_14)

"""
**10.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Площа Чорного моря становить 436 402 км2, а площа Азовського
моря становить 37 800 км2. Яку площу займають Чорне та Азов-
ське моря разом?
"""
# код вводити тут
area1 = 439402
area2 = 37800
print(f"Площа яку іони займають разом - {area1 + area2}")


"""
**11.** Створіть рядок з вашим повним ім'ям та виведіть:
- Перший символ
- Останній символ  
- Довжину рядка
"""

fullname = "Хаустова Христина Богданівна"
first_char = fullname[0]
last_char = fullname[-1]
length = len(fullname)
print(f"повне ім'я - {fullname}. перший символ - {first_char}. Останній - {last_char}. Довжина - {length} ")

"""
**12.** Створіть рядок "Would you tell me, please, which way I ought to go from here?" 
та отримайте з нього підстрічки:
- Перші 6 символів
- Останні 11 символів
"""
text = "Would you tell me, please, which way I ought to go from here?"
first_six = text[:6]
last_eleven = text[-11:]
print(first_six)
print(last_eleven)

"""
**13.** Створіть багаторядковий рядок (використовуючи потрійні лапки) зі своїм улюбленим віршем або цитатою.
"""

fav_quote = """The gaps in the black print. My own little snow garden lay in between the letters. 
This space, which was too small for someone to go into, was a perfect place for a child who liked to hide. Every time a pleasant sound was heard,
 the letters stacked up like snow"""

"""
**14.** Поєднайте два рядки "Hello" та "World" у різні способи (з пробілом, з комою, з новим рядком).
"""
w1 = "Hello"
w2 = "World"
space = w1 + " " + w2
comma = w1 + ", " + w2
newline = w1 + "\n" + w2
"""
**15.** Створіть рядок з символами, які потребують екранування (лапки, зворотна коса риска).
"""
# код вводити тут

"""
**16.** Напишіть код, який запитує у користувача його ім'я та вік, 
а потім виводить привітання у форматі: "Привіт, [ім'я]! Тобі [вік] років."
"""
name = input("Напишіть ваше ім'я: ")
age = int(input("Напишіть ваш вік: "))
print(f"Привт, {name}! Тобі {age} років.")

"""

**17.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Ігор займається фотографією. Він вирішив зібрати всі свої 232
фотографії та вклеїти в альбом. На одній сторінці може бути
розміщено щонайбільше 8 фото. Скільки сторінок знадобиться
Ігорю, щоб вклеїти всі фото?
"""
all_photo = 232
per_page = 8
required_pages = all_photo / per_page
print(required_pages)


"""
**18.** Напишіть код який запитує у користувача 
його улюблений колір та число, а потім створює персоналізоване
повідомлення використовуючи f-string форматування.
"""

color = input("Який колір вам подобається?")
number = input("Цікаво, яке у вас улюблене число?")
print(f"Зрозуміло! Твій цлюблений колір - {color}, а число - {number}!")


"""
**19.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Мережа супермаркетів має 3 склади, де всього розміщено
375 291 товар. На першому та другому складах перебуває
250 449 товарів. На другому та третьому – 222 950 товарів.
Знайдіть кількість товарів, що розміщені на кожному складі.
"""
total_warehouse = 375291
first_and_second_warehouse = 250449
second_and_third_warehouse = 222950
warehouse3 = total_warehouse - first_and_second_warehouse
warehouse1 = total_warehouse - second_and_third_warehouse
warehouse2 = first_and_second_warehouse - warehouse1
print(f"Склад1 це {warehouse1}. Склад2 це {warehouse2}. Склад3 це {warehouse3}")


"""
**20.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Михайло разом з батьками вирішили купити комп’ютер, ско-
риставшись послугою «Оплата частинами». Відомо, що сплачу-
вати необхідно буде півтора року по 1179 грн/місяць. Обчисліть
вартість комп’ютера.
"""
sum_per_month = 1179
year = 1.5
total = year * 12
print("Вартість компа:", total, "грн" )
